#+TITLE: Easy acquisition of pseudopotentials

#+PROPERTY: header-args:julia :session *julia-README*

In this directory, a small utility script for automatically listing
the pseudopotentials available from the [[http://www.tc.uni-koeln.de/PP/index.en.html][Stuttgart/Cologne database]] for
a given element:

#+BEGIN_SRC julia :exports both :results value verbatim
include("get_ecps.jl")
get_ecps("Xe")
#+END_SRC

#+RESULTS:
#+begin_example
====================================================================================================
==> ECP46MHF
! [Kr]c 4d10c 5s2 5p6
!  Q=8., MEFIT, HF, Ref 22.
ECP,Xe,46,4,0;
1; 2,1.000000,0.00000000; 
2; 2,3.815600,122.76231371; 2,1.878604,8.20135456; 
2; 2,3.003078,68.75731963; 2,1.283819,3.64084871; 
2; 2,2.027610,23.08319830; 2,0.830435,3.17298823; 
2; 2,6.246157,-48.30201724; 2,1.564998,-6.91572892;
! References:
! [22] A. Nicklass, M. Dolg, H. Stoll, H. Preuss, J. Chem. Phys. 102, 8942 (1995).
====================================================================================================
==> ECP46MWB
! [Kr]c 4d10c 5s2 5p6
!  Q=8., MEFIT, WB, Ref 22; CPP: alpha=0.8345;delta=0.97391;ncut=1.
ECP,Xe,46,5,0;
1; 2,1.000000,0.00000000; 
2; 2,3.940263,122.76382934; 2,2.277264,8.30885115; 
2; 2,3.028373,68.82300437; 2,1.394319,3.64674223; 
2; 2,2.122605,23.65207854; 2,0.798669,3.25844113; 
2; 2,6.164360,-47.70319876; 2,1.542374,-6.54113991; 
1; 2,1.847892,-7.10585060;
! References:
! [22] A. Nicklass, M. Dolg, H. Stoll, H. Preuss, J. Chem. Phys. 102, 8942 (1995).
====================================================================================================
==> ECP28MDF
! [Ar]c 3d10c 4s2 4p6 4d10 5s2 5p6
!  Q=26., MEFIT, MCDHF+Breit, Ref 36.
ECP,Xe,28,4,3;
1; 2,1.000000,0.000000; 
3; 2,40.005184,49.997962; 2,17.812214,281.013303; 2,9.304150,61.538255; 
4; 2,15.701772,67.439142; 2,15.258608,134.874711; 2,9.292184,14.663300; 2,8.559003,29.354730; 
6; 2,15.185600,35.436908; 2,14.284500,53.195772; 2,7.121889,9.046232; 2,6.991963,13.223681; 2,0.623946,0.084853; 2,0.647284,0.044155; 
4; 2,20.881557,-23.089295; 2,20.783443,-30.074475; 2,5.253389,-0.288227; 2,5.361188,-0.386924; 
4; 2,15.701772,-134.878283; 2,15.258608,134.874711; 2,9.292184,-29.326600; 2,8.559003,29.354730; 
6; 2,15.185600,-35.436908; 2,14.284500,35.463848; 2,7.121889,-9.046232; 2,6.991963,8.815787; 2,0.623946,-0.084853; 2,0.647284,0.029436; 
4; 2,20.881557,15.392863; 2,20.783443,-15.037237; 2,5.253389,0.192151; 2,5.361188,-0.193462;
! References:
! [36] K.A. Peterson, D. Figgen, E. Goll, H. Stoll, M. Dolg, J. Chem. Phys. 119, 11113 (2003).
====================================================================================================
#+end_example

The first line of each listing includes a configuration, the closed
subshells constitute a best guess of which orbitals are modelled by
the pseudopotential. The =Q= open orbitals are those that need to be
included in a calculation. No attempt is made at guessing of which
kind the pseudopotential is (non-relativistic, scalar-relativistic +
spin–orbit interaction, two-component relativistic); this has to be
inferred from the title (e.g. =ECP28MDF= is two-component
relativistic) and reading the associated reference.
